'use client'

const PersonalDataPolicyPage = () => (
  <main>
    <section className='container mx-auto px-4 sm:px-6 lg:px-8'>
      <div className='max-w-3xl mx-auto bg-white shadow-lg rounded-lg overflow-hidden mt-10'>
        <div className='px-6 py-8'>
          <h1 className='text-3xl font-bold text-gray-900 mb-6'>
            Политика обработки персональных данных
          </h1>

          <div className='space-y-6 text-gray-700'>
            <p>
              Настоящая политика обработки персональных данных составлена в
              соответствии с требованиями Федерального закона от 27.07.2006
              №152-ФЗ «О персональных данных» и определяет порядок обработки
              персональных данных и меры по обеспечению безопасности
              персональных данных ООО "Перевозка27" (далее – Оператор).
            </p>

            <h2 className='text-2xl font-semibold text-gray-800 mt-8 mb-4'>
              1. Общие положения
            </h2>
            <p>
              1.1. Оператор ставит своей важнейшей целью и условием
              осуществления своей деятельности соблюдение прав и свобод человека
              и гражданина при обработке его персональных данных, в том числе
              защиты прав на неприкосновенность частной жизни, личную и семейную
              тайну.
            </p>
            <p>
              1.2. Настоящая политика Оператора в отношении обработки
              персональных данных применяется ко всей информации, которую
              Оператор может получить о посетителях веб-сайта
              https://perevozka27.ru.
            </p>

            <h2 className='text-2xl font-semibold text-gray-800 mt-8 mb-4'>
              2. Основные понятия, используемые в Политике
            </h2>
            <p>
              2.1. Автоматизированная обработка персональных данных – обработка
              персональных данных с помощью средств вычислительной техники.
            </p>
            <p>
              2.2. Блокирование персональных данных – временное прекращение
              обработки персональных данных (за исключением случаев, если
              обработка необходима для уточнения персональных данных).
            </p>
            <p>
              2.3. Веб-сайт – совокупность графических и информационных
              материалов, а также программ для ЭВМ и баз данных, обеспечивающих
              их доступность в сети интернет по сетевому адресу
              https://perevozka27.ru.
            </p>
            <p>
              2.4. Персональные данные – любая информация, относящаяся прямо или
              косвенно к определенному или определяемому Пользователю веб-сайта
              https://perevozka27.ru.
            </p>

            <h2 className='text-2xl font-semibold text-gray-800 mt-8 mb-4'>
              3. Основные права и обязанности Оператора
            </h2>
            <p>3.1. Оператор имеет право:</p>
            <ul className='list-disc pl-6 space-y-2'>
              <li>
                получать от субъекта персональных данных достоверные информацию
                и/или документы, содержащие персональные данные;
              </li>
              <li>
                в случае отзыва субъектом персональных данных согласия на
                обработку персональных данных, оператор вправе продолжить
                обработку персональных данных без согласия субъекта персональных
                данных при наличии оснований, указанных в Федеральном законе от
                27.07.2006 №152-ФЗ «О персональных данных»;
              </li>
            </ul>
            <p>3.2. Оператор обязан:</p>
            <ul className='list-disc pl-6 space-y-2'>
              <li>
                предоставлять субъекту персональных данных по его просьбе
                информацию, касающуюся обработки его персональных данных;
              </li>
              <li>
                организовывать обработку персональных данных в порядке,
                установленном действующим законодательством РФ;
              </li>
              <li>
                обеспечивать сохранность персональных данных субъектов
                персональных данных;
              </li>
            </ul>

            <h2 className='text-2xl font-semibold text-gray-800 mt-8 mb-4'>
              4. Цели сбора персональных данных
            </h2>
            <p>4.1. Цели обработки персональных данных Пользователя:</p>
            <ul className='list-disc pl-6 space-y-2'>
              <li>
                информирование Пользователя путем отправки электронных писем;
              </li>
              <li>
                заключение, исполнение и прекращение гражданско-правовых
                договоров;
              </li>
              <li>
                предоставление доступа Пользователю к сервисам, информации и/или
                материалам, содержащимся на веб-сайте.
              </li>
            </ul>
            <p>
              4.2. Оператор не осуществляет обработку биометрических
              персональных данных (сведения, которые характеризуют
              физиологические и биологические особенности человека, на основании
              которых можно установить его личность).
            </p>
            <p>
              4.3. Оператор не выполняет обработку специальных категорий
              персональных данных, касающихся расовой, национальной
              принадлежности, политических взглядов, религиозных или философских
              убеждений, здоровья, интимной жизни.
            </p>

            <h2 className='text-2xl font-semibold text-gray-800 mt-8 mb-4'>
              5. Правовые основания обработки персональных данных
            </h2>
            <p>
              5.1. Оператор обрабатывает персональные данные Пользователя только
              в случае их заполнения и/или отправки Пользователем самостоятельно
              через специальные формы, расположенные на сайте. Заполняя
              соответствующие формы и/или отправляя свои персональные данные
              Оператору, Пользователь выражает свое согласие с данной Политикой.
            </p>
            <p>
              5.2. Правовыми основаниями обработки персональных данных является:
            </p>
            <ul className='list-disc pl-6 space-y-2'>
              <li>
                Федеральный закон от 27.07.2006 г. №152-ФЗ «О персональных
                данных»;
              </li>
              <li>Устав ООО "Перевозка27";</li>
              <li>
                договоры, заключаемые между оператором и субъектом персональных
                данных;
              </li>
              <li>согласие на обработку персональных данных.</li>
            </ul>

            <h2 className='text-2xl font-semibold text-gray-800 mt-8 mb-4'>
              6. Условия обработки персональных данных
            </h2>
            <p>
              6.1. Обработка персональных данных осуществляется с согласия
              субъекта персональных данных на обработку его персональных данных.
            </p>
            <p>
              6.2. Обработка персональных данных необходима для исполнения
              договора, стороной которого является субъект персональных данных,
              а также для заключения договора по инициативе субъекта
              персональных данных.
            </p>
            <p>
              6.3. Оператор обрабатывает персональные данные Пользователя в
              соответствии с внутренними нормативными документами.
            </p>
            <p>
              6.4. Доступ к персональным данным предоставляется только тем
              сотрудникам, которым эта информация необходима для выполнения
              конкретных функций.
            </p>

            <h2 className='text-2xl font-semibold text-gray-800 mt-8 mb-4'>
              7. Заключительные положения
            </h2>
            <p>
              7.1. Пользователь может получить любые разъяснения по интересующим
              вопросам, касающимся обработки его персональных данных,
              обратившись к Оператору с помощью электронной почты
              perevozka27@gmail.com.
            </p>
            <p>
              7.2. В данном документе будут отражены любые изменения политики
              обработки персональных данных Оператором. Политика действует
              бессрочно до замены ее новой версией.
            </p>
          </div>
        </div>
      </div>
    </section>
  </main>
)

export default PersonalDataPolicyPage
